Interesting. Doing so removed the error.

```
module "redis" {
  source  = "terraform-aws-modules/elasticache/aws"
  version = "~> 1.6.0"

  replication_group_id       = "amcache-sp-adpl-prod"
  description                = "amcache-sp-adpl-prod"
  num_cache_clusters         = 2
  node_type                  = "cache.t4g.small"
  engine_version             = "7.1"
  port                       = 6379
  maintenance_window         = "mon:03:00-mon:04:00"
  snapshot_window            = "04:00-06:00"
  snapshot_retention_limit   = 7
  automatic_failover_enabled = true
  at_rest_encryption_enabled = true
  transit_encryption_enabled = true
  transit_encryption_mode    = "preferred"
  auth_token                 = "1234567890asdfghjkl"
  apply_immediately          = true
  subnet_ids                 = ["subnet-00bc4da9b7cc01449",  "subnet-021567bceaacf65ee"]
  create_security_group      = false
  security_group_ids         = [sg-REDACTED]
  parameter_group_family     = "redis7"
  parameters = [
    {
      name  = "repl-backlog-size"
      value = "16384"
    }
  ]
  log_delivery_configuration = [
    {
      destination_type = "cloudwatch-logs"
      destination      = "REDACTED"
      log_format       = "json"
      log_type         = "engine-log"
    }
  ]
  tags = merge(var.commonTagsGlobal, { Component = "SP Redis Cache", CreateDate = "20240308" })
}
```

Execution:
```
$ terraform plan --target 'module.redis' --out newstuff
module.log_group["prod-adpl-ecs-web-task-01"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-ecs-web-task-01]
module.log_group["prod-adpl-ecs-commonlogin-task"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-ecs-commonlogin-task]
module.log_group["prod-adpl-sp-elasticache-redis"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-sp-elasticache-redis]
module.log_group["prod-adpl-ecs-api-task-01"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-ecs-api-task-01]
module.log_group["prod-adpl-elasticache-redis"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-elasticache-redis]
module.log_group["prod-adpl-batch"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-batch]
module.vpc["prod"].aws_vpc.this[0]: Refreshing state... [id=vpc-0a7ce619e76251d7c]
module.log_group["prod-adpl-ecs-apisvc-task-01"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-ecs-apisvc-task-01]
module.log_group["prod-adpl-batch-out"].aws_cloudwatch_log_group.this[0]: Refreshing state... [id=prod-adpl-batch-out]
module.vpc["prod"].aws_subnet.private[1]: Refreshing state... [id=subnet-021567bceaacf65ee]
module.vpc["prod"].aws_subnet.private[0]: Refreshing state... [id=subnet-00bc4da9b7cc01449]
module.security_group["prod-self"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d165f3388b9e9be3]
module.security_group["prod-internal-RRD"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0986bb31f0f227b47]
module.security_group["prod-lb-sp-public-access"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-076e43b2eb2c76144]
module.security_group["prod-lb-customer"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0806d977be4765842]
module.security_group["prod-lb-customer_2"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-01ffb1b03354c84e5]
module.security_group["prod-lb"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a04d124980661d9f]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.redis.aws_cloudwatch_log_group.this["0"] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/elasticache/amcache-sp-adpl-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all          = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
    }

  # module.redis.aws_elasticache_replication_group.this[0] will be created
  + resource "aw7s_elasticache_replication_group" "this" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token                     = (sensitive value)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "amcache-sp-adpl-prod"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = "mon:03:00-mon:04:00"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t4g.small"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + parameter_group_name           = (known after apply)
      + port                           = 6379
      + preferred_cache_cluster_azs    = []
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "amcache-sp-adpl-prod"
      + security_group_ids             = [
          + REDACTED",
          + "REDACTED",
        ]
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 7
      + snapshot_window                = "04:00-06:00"
      + subnet_group_name              = "amcache-sp-adpl-prod"
      + tags                           = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all                       = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
      + transit_encryption_enabled     = true
      + transit_encryption_mode        = "preferred"

      + log_delivery_configuration {
          + destination      = "/aws/elasticache/amcache-sp-adpl-prod"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
    }

  # module.redis.aws_elasticache_subnet_group.this[0] will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group"
      + id          = (known after apply)
      + name        = "amcache-sp-adpl-prod"
      + subnet_ids  = [
          + "subnet-00bc4da9b7cc01449",
          + "subnet-021567bceaacf65ee",
        ]
      + tags        = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
      + tags_all    = {
          + "AppOwner"              = REDACTED
          + "BackupPlan"            = REDACTED
          + "Classification"        = REDACTED
          + "Component"             = REDACTED
          + "CostCenter"            = REDACTED
          + "CreateDate"            = REDACTED
          + "Creator"               = REDACTED
          + "Ticket"                = REDACTED
          + "Tier"                  = REDACTED
          + "terraform-aws-modules" = "elasticache"
        }
      + vpc_id      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error message.
╵
╷
│ Warning: Argument is deprecated
│
│   with module.vpc.aws_eip.nat,
│   on .terraform/modules/vpc/main.tf line 1032, in resource "aws_eip" "nat":
│ 1032:   vpc = true
│
│ vpc is deprecated. Use domain instead.
╵

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: newstuff

To perform exactly these actions, run the following command to apply:
    terraform apply "newstuff"
```